controllers/LivroController.php

SELECT * FROM `livro` WHERE `id`='1'
---
    protected function findModel($id)
    {
        if (($model = Livro::findOne($id)) !== null) {