controllers/UsuarioController.php

    protected function findModel($id)
    {
        if (($model = Usuario::findOne($id)) !== null) {
---
SELECT * FROM `usuario` WHERE `id`='3'