models/Usuario.php

SELECT * FROM `usuario` WHERE `id`=3
---
    public static function findIdentity($id)
    {
        return static::findOne($id);